package com.baemin.util.swsw;

import java.util.ArrayList;
import java.util.List;
import java.util.StringTokenizer;

import com.baemin.shop.ShopDTO;

public class String2Shop {

    public static void main(String[] args) {

        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

        String msg = "밤새먹소|음식점 > 한식 > 육류,고기|서울 구로구 구로동 603-9|02-2068-7637|126.881006458503|37.5032690729499|||눈꽃한우서래갈비|음식점 > 한식 > 육류,고기 > 갈비|서울 구로구 구로동 544|02-862-3611|126.887542753737|37.5036466903643|||속초붉은대게|음식점 > 한식 > 해물,생선 > 게,대게|서울 구로구 신도림동 412-3|02-2633-8919|126.881846630684|37.5040628007395|||강촌숯불닭갈비 본점|음식점 > 한식 > 육류,고기 > 닭요리|서울 구로구 구로동 29-22|02-851-2194|126.891721612309|37.5044326670946|||송이족발 구로역점|음식점 > 한식 > 육류,고기 > 족발,보쌈|서울 구로구 구로동 569-9|02-859-9290|126.882758815298|37.5022112430018|||곱분이곱창 신도림점|음식점 > 한식 > 육류,고기 > 곱창,막창|서울 구로구 구로동 40-10|02-866-0260|126.890822721349|37.503502002478|||라도맨션|음식점 > 한식 > 육류,고기 > 삼겹살|서울 구로구 구로동 31-2|02-3667-1001|126.89028478551592|37.50477732724758|||라도맨션골드|음식점 > 한식 > 육류,고기|서울 구로구 구로동 31-2|02-851-1116|126.890296105725|37.5047701297214|||초가집부뚜막청국장|음식점 > 한식|서울 구로구 구로동 528-1|02-863-0600|126.887463357613|37.4992785403422|||더족발 본점|음식점 > 한식 > 육류,고기 > 족발,보쌈|서울 구로구 신도림동 435-10|02-2636-9288|126.884091024632|37.5066166699615|||서울안심축산 구로본점|음식점 > 한식 > 육류,고기|서울 구로구 구로동 110-4|02-854-5445|126.8896820899|37.5008591950708|||신도림참족발|음식점 > 한식 > 육류,고기 > 족발,보쌈|서울 구로구 신도림동 337|02-3439-7182|126.887746727372|37.5094205223262|||문어부인삼교비 신도림점|음식점 > 한식 > 육류,고기|서울 구로구 신도림동 337|02-3439-7892|126.88696491447|37.5088467380551|||새벽집양곱창 신도림점|음식점 > 한식 > 육류,고기 > 곱창,막창|서울 구로구 신도림동 694|02-2296-0325|126.8840880533434|37.507806894045075|||";

        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

        // msg = msg.replaceAll("|||", "\n\n");

        //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

        StringTokenizer st1 = new StringTokenizer(msg, "|||");

        List<ShopDTO> list = new ArrayList<>();

        while (st1.hasMoreTokens()) {
            String temp = st1.nextToken();
            StringTokenizer st2 = new StringTokenizer(temp, "|");
            ShopDTO dto = new ShopDTO();
            while (st2.hasMoreTokens()) {

            }

        }
    }

}